一、指针
1.声明指针:类型 * 变量名 如,int * p;(p是指向int类型的指针,赋值给p的是一个&地址)

2.指针的作用:存储变量的地址。 如, &var(%p转换说明) 即可获得变量的16进制地址(以字节编码,能确认下一个元素的地址)
							 p = &var; val = *p 可获得该地址上的值;

3.指针基础:&给出改变量的地址
		  *给出存储在指针指向地址上的值

4.指针规范:声明时,*使用空格(如,int * p);解引用变量时省略空格(如,*p).

5.编程时,可以认为变量的两个属性:名称和值;计算机认为变量的两个属性:(&地址和*值);指针认为地址是基本量,而值是派生量.

6.使用&、*和指针可以操控地址和地址上的内容.

7.被调函数要改变主调函数的变量(不是指return),要使用指针作为参数(比如两值交换).

8.指针操作:①赋值:p=arr;p=&arr[0]; ②解引用:*p=100; ③取址:%p; ④指针与整数相加:p+4==&arr[4];
		  ⑤递增指针:p++ (指向下一个元素,地址+字节(类型大小),值指向下一位);
		  ⑥指针减去一个整数:p-2; ⑦递减指针:p--(与递增相反); ⑧指针求差:p-p2(求出两元素之间的距离,相隔几个元素);
		  ⑨比较:(当两个指针指向同一对象时,可用关系运算符进行比较两个指针的值);[注:*和++优先级相同,从右到左]

9.指向多维数组的指针:①int (* p) [2] (p指向内含两个int元素的数组,即二维数组)
	           	  ②int * p [2]   (p是一个内含两个指针元素的数组)
				  [区别:[]比*优先级高,都是数组,①是一个指针,②是两个指针]

二、数组(操作数组常用循环,一维一个for循环,二维两个for循环,如此类推...)
(数组用于存储相同类型的数据,C把数组看作是派生类型)
1.初始化数组:int arr[5]={1,2,3,4,5};
	        double arr[4][5]={
				{1,2,3,4,5},
				{6,7,8,9,10},
				{11,12,13,14,15},
				{16,17,18,19,20}
			};

2.指定初始化器:int arr[10]={31,28,[4]=11,16,19,[2]=6};(指定初始化的下标后面的值默认为下标递增;后面的值会覆盖前面;没有设置下标的值,默认为0)

3.指定数组大小:①#define SIZE 4 -> int arr[SIZE];②int arr[4];③int arr[5*2-3];

4.多维数组:int arr[3][4];int arr[ROWS][COLS];

5.变长数组(VLA):允许用变量表示数组维度,之前是用 #define 表示数组维度的
				int rows=3,cols=4;
				double arr[rows][cols];
				int sum(int rows,int cols,int arr[rows][cols])

6.复合字面量:①声明: (int [2]){1,2}   [丢了‘数组名’和‘=’]
		   ②匿名形式,创建同时就要使用
		   ③使用: A.指针赋值 int * p; p = (int [2]){10,20};
		          B.形参传递 sum((int [4]){10,15,20,25},4)

三、数组与指针(形异实同)
1.表达式:
		①int * p;                     ②dates+2=&dates[2];(数组名运算，变化的是地址)
		p=arr;(数组名是该数组的首地址)	   *(dates+2)=dates[2];（*指针运算,变化的是值）
		p=&arr[0];
[二维数组与指针,zippo是二维数组]
		③*(*(zippo+2)+3)			④p=zippo(需要解引用两次,才能得到值)
 		    zippo[2][3]					*zippo=&zippo[0](*后是地址,**后才是值)
 		    							**zippo=zippo[0][0]
 		    							*(zippo+2)+1 (&zippo[2][1])
 		⑤地址:&zippo[0][0]
 		      zippo[0]
 		      *zippo
2.函数:
		①int sum(int *ar,int n)	  ->sum(arr,n);
		  int sum(int ar[],int n) ->sum(arr,n);

		②int sum(int (*ar)[4],int rows) ->sum(arr,rows);
		 int sum(int ar[][4],int rows) ->sum(arr,rows);

		③int sum(int (*ar)[4][5],int rows) ->sum(arr,rows);
		  int sum(int ar[][4][5],int rows) ->sum(arr,rows);

	    ④int sum(int rows,int cols,int arr[rows][cols]) ->sum(rows,cols,arr);

3.const:①const 数组不能赋给普通指针(可以赋给const int * p);[const 中数据不能用普通指针改变]